sessions/R13-slotted-counter/results/repeat/repeat/run2/zipf/auto-zipf-th200.k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/beomsu/Desktop/incident-lab/sessions/R13-slotted-counter/scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
              * sponsor: 100 looping VUs for 1m0s (gracefulStop: 10s)

time="2026-07-31T18:36:52+09:00" level=info msg="[분포] 시나리오=zipf 방송=1000 s=1.2 | 1위 방송 23.1% · 상위10 56.9% · 상위1% 56.9%" source=console

running (0m01.0s), 100/100 VUs, 3615 complete and 0 interrupted iterations
sponsor   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 7569 complete and 0 interrupted iterations
sponsor   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 11652 complete and 0 interrupted iterations
sponsor   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 15651 complete and 0 interrupted iterations
sponsor   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 19764 complete and 0 interrupted iterations
sponsor   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 23580 complete and 0 interrupted iterations
sponsor   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 27667 complete and 0 interrupted iterations
sponsor   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 31923 complete and 0 interrupted iterations
sponsor   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 36015 complete and 0 interrupted iterations
sponsor   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 39846 complete and 0 interrupted iterations
sponsor   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 43777 complete and 0 interrupted iterations
sponsor   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 47946 complete and 0 interrupted iterations
sponsor   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 52074 complete and 0 interrupted iterations
sponsor   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 56141 complete and 0 interrupted iterations
sponsor   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 60146 complete and 0 interrupted iterations
sponsor   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 63751 complete and 0 interrupted iterations
sponsor   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 67936 complete and 0 interrupted iterations
sponsor   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 71920 complete and 0 interrupted iterations
sponsor   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 76097 complete and 0 interrupted iterations
sponsor   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 80003 complete and 0 interrupted iterations
sponsor   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 84018 complete and 0 interrupted iterations
sponsor   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 87941 complete and 0 interrupted iterations
sponsor   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 91967 complete and 0 interrupted iterations
sponsor   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 95962 complete and 0 interrupted iterations
sponsor   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 100156 complete and 0 interrupted iterations
sponsor   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 103916 complete and 0 interrupted iterations
sponsor   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 107736 complete and 0 interrupted iterations
sponsor   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 111978 complete and 0 interrupted iterations
sponsor   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 115688 complete and 0 interrupted iterations
sponsor   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 119762 complete and 0 interrupted iterations
sponsor   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 123917 complete and 0 interrupted iterations
sponsor   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 128100 complete and 0 interrupted iterations
sponsor   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 132202 complete and 0 interrupted iterations
sponsor   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 136342 complete and 0 interrupted iterations
sponsor   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 140382 complete and 0 interrupted iterations
sponsor   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 144522 complete and 0 interrupted iterations
sponsor   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 148619 complete and 0 interrupted iterations
sponsor   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 152610 complete and 0 interrupted iterations
sponsor   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 156624 complete and 0 interrupted iterations
sponsor   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 160526 complete and 0 interrupted iterations
sponsor   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 164584 complete and 0 interrupted iterations
sponsor   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 168727 complete and 0 interrupted iterations
sponsor   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 172918 complete and 0 interrupted iterations
sponsor   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 177033 complete and 0 interrupted iterations
sponsor   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 181091 complete and 0 interrupted iterations
sponsor   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 185003 complete and 0 interrupted iterations
sponsor   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 189051 complete and 0 interrupted iterations
sponsor   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 193293 complete and 0 interrupted iterations
sponsor   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 197566 complete and 0 interrupted iterations
sponsor   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 201779 complete and 0 interrupted iterations
sponsor   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 205907 complete and 0 interrupted iterations
sponsor   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 210052 complete and 0 interrupted iterations
sponsor   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 214180 complete and 0 interrupted iterations
sponsor   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 218245 complete and 0 interrupted iterations
sponsor   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 222419 complete and 0 interrupted iterations
sponsor   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 226543 complete and 0 interrupted iterations
sponsor   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 230774 complete and 0 interrupted iterations
sponsor   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 234975 complete and 0 interrupted iterations
sponsor   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 239223 complete and 0 interrupted iterations
sponsor   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 243579 complete and 0 interrupted iterations
sponsor   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 243687  4059.442268/s
    checks_succeeded...: 100.00% 243687 out of 243687
    checks_failed......: 0.00%   0 out of 243687

    ✓ status 200

    CUSTOM
    sponsor_latency................: avg=24.55ms min=8.32ms med=23.93ms p(95)=36.04ms p(99)=48.42ms max=104.15ms

    HTTP
    http_req_duration..............: avg=24.55ms min=8.32ms med=23.93ms p(95)=36.04ms p(99)=48.42ms max=104.15ms
      { expected_response:true }...: avg=24.55ms min=8.32ms med=23.93ms p(95)=36.04ms p(99)=48.42ms max=104.15ms
    http_req_failed................: 0.00%  0 out of 243687
    http_reqs......................: 243687 4059.442268/s

    EXECUTION
    iteration_duration.............: avg=24.62ms min=8.42ms med=23.99ms p(95)=36.11ms p(99)=48.49ms max=104.19ms
    iterations.....................: 243687 4059.442268/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 18 MB  297 kB/s
    data_sent......................: 42 MB  697 kB/s



running (1m00.0s), 000/100 VUs, 243687 complete and 0 interrupted iterations
sponsor ✓ [ 100% ] 100 VUs  1m0s